# CropBoxVisible Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..CropBoxVisible Property
View Class See Also
---
Whether or not the Crop Box/Region is visible for the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool CropBoxVisible { get; set; }
```

Visual Basic
---
```text
Public Property CropBoxVisible As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool CropBoxVisible {
	bool get ();
	void set (bool value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | Thrown when getting this property, if the view is a template and cannot have a crop box applied. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when setting this property, if the view is a template and cannot have a crop box applied. |

# See Also
View Class
Autodesk.Revit.DB Namespace